In [1]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/csv_data

# Comparison
- ## Comparison operators in SQL are used to filter and retrieve specific data from a database based on specified conditions.
<br>

- ## These operators enable you to compare values in columns with specified values or expressions.
<br>

- ## The WHERE clause in SQL queries often incorporates these comparison operators to narrow down the result set according to certain criteria.
<br>

In [2]:
%sql SELECT * FROM data

 * mysql+pymysql://root:***@localhost:3307/csv_data
4 rows affected.

[(1, 'John', 45000),
 (2, 'Jane', 50000),
 (3, 'Bob', 55000),
 (4, 'Alice', 60000)]

## = Equal To
- ### Extract Value if expression equal to condition
- ### Filter the Value on Specfic Condition

In [3]:
%sql SELECT Name FROM data WHERE salary = 50000

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('Jane',)]

## != , <> Not Equal To
- ### Extract Value if expression not equal to condition
- ### Filter the Value on Specfic Condition

In [5]:
%sql SELECT * FROM data WHERE salary != 50000

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(1, 'John', 45000), (3, 'Bob', 55000), (4, 'Alice', 60000)]

In [4]:
# <> same work as !=
%sql SELECT * FROM data WHERE salary <> 50000

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(1, 'John', 45000), (3, 'Bob', 55000), (4, 'Alice', 60000)]

## > greater than
- ### Extract Value if expression are greater than to the condition
- ### Filter the Value on Specfic Condition

In [6]:
%sql SELECT * FROM data WHERE salary > 50000

 * mysql+pymysql://root:***@localhost:3307/csv_data
2 rows affected.

[(3, 'Bob', 55000), (4, 'Alice', 60000)]

## >= greater than or equal to
- ### Extract Value if expression are greater than or Equal to the condition
- ### Filter the Value on Specfic Condition

In [7]:
%sql SELECT * FROM data WHERE salary >= 50000

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[(2, 'Jane', 50000), (3, 'Bob', 55000), (4, 'Alice', 60000)]

## < Smaller than
- ### Extract Value if expression are smaller than to the condition
- ### Filter the Value on Specfic Condition

In [9]:
%sql SELECT * FROM data WHERE salary < 50000

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[(1, 'John', 45000)]

## < Smaller than or equal to
- ### Extract Value if expression are smaller than or equal to the condition
- ### Filter the Value on Specfic Condition

In [10]:
%sql SELECT * FROM data WHERE salary <= 50000

 * mysql+pymysql://root:***@localhost:3307/csv_data
2 rows affected.

[(1, 'John', 45000), (2, 'Jane', 50000)]

<hr>

# Logical 
- ## logical operators are used to combine multiple conditions in the WHERE clause of a query.

In [13]:
%%sql 
SELECT * FROM lg

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('John', 'Doe', 35, 'London'),
 ('Jane', 'Smith', 40, 'New York'),
 ('Bob', 'Johnson', 45, 'London'),
 ('Alice', 'Brown', 46, 'Paris'),
 ('Charlie', 'Wilson', 30, 'London')]

## ALL
- ## The term "ALL" in SQL is used in combination with comparison operators to compare a value to all values returned by a subquery.
- ## It returns TRUE if the comparison is true for all values in the subquery result, and FALSE otherwise.

In [14]:
%sql SELECT * FROM lg WHERE age > ALL (SELECT age FROM lg WHERE location = 'London');

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('Alice', 'Brown', 46, 'Paris')]

### london location age 30,35,45

### total age 30,35,45,40,46

### 30 > of all london age (30,35,45) False
### 35 > of all london age (30,35,45) False
### 45 > of all london age (30,35,45) False
### 40 > of all london age (30,35,45) False
### 46 > of all london age (30,35,45) True
### So paris age (46) is greater than of all (30,35,45) london age
### So 46 age condition are satisfied
<br>

## ALL means if all of ages must be greater than whole condition True

<br>

## ANY / SOME

- ## The ANY operator in SQL is used to compare a value to any value in a set of values.
- ## It is often used in combination with a subquery that returns multiple values.
- ## The ANY operator returns TRUE if the comparison is true for at least one value in the set, and FALSE otherwise.
<br>

- ### SOME Same as ANY

In [16]:
%sql SELECT * FROM lg WHERE age > ANY (SELECT age FROM lg WHERE location = 'London');

 * mysql+pymysql://root:***@localhost:3307/csv_data
4 rows affected.

[('John', 'Doe', 35, 'London'),
 ('Jane', 'Smith', 40, 'New York'),
 ('Bob', 'Johnson', 45, 'London'),
 ('Alice', 'Brown', 46, 'Paris')]

### london location age 30,35,45
### total age 30,35,45,40,46

### 30 > of any london age (30,35,45)  All 30,35,45 are False
### 35 > of any london age (30,35,45) True 
### 45 > of any london age (30,35,45) True
### 40 > of any london age (30,35,45) True
### 46 > of any london age (30,35,45) True

## SO John,Jane,Bob,Alice age greater than of any conditions of (35,45)
<br>

## Any means if Any of ages must be greater whole condition True

<br>

### Some same as ANY

In [17]:
%sql SELECT * FROM lg WHERE age > SOME (SELECT age FROM lg WHERE location = 'London');

 * mysql+pymysql://root:***@localhost:3307/csv_data
4 rows affected.

[('John', 'Doe', 35, 'London'),
 ('Jane', 'Smith', 40, 'New York'),
 ('Bob', 'Johnson', 45, 'London'),
 ('Alice', 'Brown', 46, 'Paris')]

<br>

## AND
- ### The AND operator is a logical operator in SQL that combines two or more conditions in a WHERE clause.
- ### It returns true if all the conditions separated by AND are true; otherwise, it returns false.

In [18]:
%sql SELECT * FROM lg WHERE age > 40 AND age < 46

 * mysql+pymysql://root:***@localhost:3307/csv_data
1 rows affected.

[('Bob', 'Johnson', 45, 'London')]

<br>

# BETWEEN
- ### The BETWEEN operator in SQL is used to filter the result set based on a specified range of values.
- ### It is typically used in the WHERE clause of a SQL query.

In [19]:
%sql SELECT * FROM lg WHERE age BETWEEN 40 AND 46

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[('Jane', 'Smith', 40, 'New York'),
 ('Bob', 'Johnson', 45, 'London'),
 ('Alice', 'Brown', 46, 'Paris')]

## OR
- ### The OR operator in SQL is a logical operator that is used to combine multiple conditions in a WHERE clause.
- ### It returns true if at least one of the conditions separated by OR is true.
- ### In other words, if any of the specified conditions is true, the OR operator returns true for that row.

In [20]:
%sql SELECT * FROM lg WHERE age = 46 OR location != 'London'

 * mysql+pymysql://root:***@localhost:3307/csv_data
2 rows affected.

[('Jane', 'Smith', 40, 'New York'), ('Alice', 'Brown', 46, 'Paris')]

<br>

# IN
- ### The IN operator in SQL is used to specify multiple values in a WHERE clause.
- ### It is particularly useful when you want to filter the result set based on whether a column's value matches any value in a specified list.

In [21]:
%sql SELECT * FROM lg WHERE age IN (46,45)

 * mysql+pymysql://root:***@localhost:3307/csv_data
2 rows affected.

[('Bob', 'Johnson', 45, 'London'), ('Alice', 'Brown', 46, 'Paris')]

<br>

# NOT IN
- ### The NOT IN operator in SQL is used to filter the result set based on the absence of values in a specified list.
- ### It is essentially the negation of the IN operator.
- ### The NOT IN operator returns rows where the specified column's value does not match any value in the provided list.

In [22]:
%sql SELECT * FROM lg WHERE age NOT IN (46,45)

 * mysql+pymysql://root:***@localhost:3307/csv_data
3 rows affected.

[('John', 'Doe', 35, 'London'),
 ('Jane', 'Smith', 40, 'New York'),
 ('Charlie', 'Wilson', 30, 'London')]

<br>

# IS NULL
- ### In SQL, the IS NULL condition is used to check if a specified column or expression has a NULL value.
- ### It is often used in the WHERE clause of a SELECT statement to filter rows based on the presence of NULL values in a particular column.

In [23]:
%sql SELECT * FROM lg WHERE age IS NULL
# null value not exits in data

 * mysql+pymysql://root:***@localhost:3307/csv_data
0 rows affected.

[]

<br>

# IS NOT NULL
- ### In SQL, the IS NOT NULL condition is used to check if a specified column or expression does not have a NULL value.
- ### It is often used in the WHERE clause of a SELECT statement to filter rows based on the absence of NULL values in a particular column.

In [25]:
%sql SELECT * FROM lg WHERE age IS NOT NULL

 * mysql+pymysql://root:***@localhost:3307/csv_data
5 rows affected.

[('John', 'Doe', 35, 'London'),
 ('Jane', 'Smith', 40, 'New York'),
 ('Bob', 'Johnson', 45, 'London'),
 ('Alice', 'Brown', 46, 'Paris'),
 ('Charlie', 'Wilson', 30, 'London')]

<br>

## EXISTS
- ## In SQL, the EXISTS operator is used in a subquery to test whether the subquery returns any rows.
- ### The EXISTS condition is often used in conjunction with a correlated subquery, where the result of the subquery depends on the values of the outer query.

In [26]:
%%sql
SELECT *
FROM lg
WHERE EXISTS (
    SELECT *
    FROM lg AS sub
    WHERE sub.location = 'London'
    AND sub.age < 40
    AND sub.firstname = lg.firstname
);

 * mysql+pymysql://root:***@localhost:3307/csv_data
2 rows affected.

[('John', 'Doe', 35, 'London'), ('Charlie', 'Wilson', 30, 'London')]